import React, { useState, useEffect } from "react";
import {
  View,
  Text,
  TouchableOpacity,
  Linking,
  ScrollView,
  Image,
} from "react-native";

import { styles } from "../styles/styles.js";

export const Sagas = ({ navigation }) => {
  return (
    <ScrollView>
      <Image
        source={{
          uri: "https://www.noncreativeblog.net/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Feddacover.17af14d4.jpg&w=384&q=75",
        }}
        style={{ width: "100%", height: 300 }}
      />
      <View style={styles.container}>
        <Text style={styles.text}>
          {" "}
          Völuspá, на староисландски Vǫluspá, е първата и в повечето отношения
          най-забележителна поема-песен от така наречената Поетична Еда (Codex
          Regius). Тя представлява история на света и съдбата на боговете и
          хората, завършваща с кратко, но възторжено описание на един нов и
          по-добър свят, който ще последва. Името на поемата - "Предсказанието
          на Пророчицата" (или "Пророчеството на гадателката") - идва от факта,
          че то е поставено в устата на призована от Один гадателка, така
          наречената völva (гадателка), която отправя думите си към целия
          човешки род.
        </Text>
        <Text style={styles.text}>
          Поетичната Еда, позната още като Старата Еда, е модерното наименование
          на колекция нордически стихотворения, които са различни от Прозаичната
          (или Младата) Еда, написана от Снуре Стурласон. Съществуват няколко
          версии, всички предимно от текстове от исландския средновековен
          ръкопис – Codex Regius. Codex Regius е може би най-важният запазен
          източник на скандинавската митология и германските героични легенди, а
          от началото на XIX век насам, той има силно влияние върху по-късните
          скандинавски литератури. Поети, повлияни от Codex Regius са: Вилхелм
          Екелунд, Аугуст Стриндберг, Дж. Р. Р. Толкин, Езра Паунд, Хорхе Луис
          Борхес и Карин Бойе. Codex Regius е написан през XIII век, но нищо не
          се знае за неговото местонахождение до 1643 г., когато влиза в
          притежание на Бриньолфур Свейнсон, а след това – на епископа на
          Скалхолт. По това време версии на Еда са били известни в Исландия, но
          учени спекулират, че някога е имало друга Еда, Стара Еда, която
          съдържа езическите поеми, които Снуре цитира в своята Еда. Епископ
          Бриньолфур изпраща Codex Regius като подарък на датския крал, откъдето
          идва и името. В продължение на векове се съхранява в Кралската
          библиотека в Копенхаген, но е върната обратно в Исландия през 1971 г.
          Codex Regius или Кралската книга (на исландски: Konungsbók), в който
          са запазени много нордически поеми. Състои се от 45 листа и се смята,
          че е написан през 70-те години на XIII век. Първоначално е съдържал
          още 8 листа, които сега липсват. Той е единственият източник за
          повечето от включените в него поеми. В научни текстове този ръкопис
          обикновено се съкращава като [R] за Codex Regius, или като [К] за
          Konungsbók. Нищо не е известно за местонахождението на книгата до 1643
          г., когато става притежание на Бриньолфур Свейнсон, а след това и на
          епископа на Скалхолт, който през 1662 г. я подарява на крал Фредерик
          III на Дания, откъдето идва и името ѝ. След това се държи в Кралската
          библиотека в Копенхаген до 21 април 1971 г., когато е върната обратно
          в Рейкявик и се пази в института Арни Магнусон за исландски науки. Тъй
          като превозът със самолет не е бил изцяло безопасен за такива ценни
          товари, ръкописът е транспортиран с кораб и придружен от военен
          ескорт.
        </Text>
        <Text
          style={{
            width: "100%",
            textAlign: "center",
            color: "silver",
            fontSize: 20,
            marginBottom: 25,
            marginTop: 25,
          }}
        >
          На български
        </Text>
        <Image
          source={{
            uri: "https://www.noncreativeblog.net/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fvoluspa.0c3d8755.png&w=2048&q=75",
          }}
          style={{ width: "100%", height: 300 }}
        />
        <Text style={styles.text}>
          "Предсказанието на Пророчицата" е вдъхновяващ превод на епичната поема
          Völuspá. Този превод, извършен от Айгир Сверисон и Яна Чанкова,
          съчетава майсторство и преданост към оригиналния текст. Книгата
          разказва за пророчество на загадъчната гадателка , която води читателя
          през древни времена и събужда в него вълнението и любопитството към
          скритите истории на света. Съдържанието е обогатено със символизъм и
          мистика, които правят "Предсказанието на Пророчицата" несравнимо
          литературно произведение. Важно е да се подчертае, че този превод
          подлежи на авторски права, което гарантира уважение към
          интелектуалната собственост и работата на преводачите.
        </Text>
        <TouchableOpacity
          style={{
            borderRadius: 5,
            backgroundColor: "#1a1a1a",
            width: "60%",
            padding: "4%",
            height: "50px !important",
            alignItems: "center",
            marginBottom: "5%",
          }}
          onPress={() => Linking.openURL("https://google.com")}
        >
          <Text
            style={{
              color: "#b0903d",
            }}
          >
            Чети онлайн
          </Text>
        </TouchableOpacity>
      </View>
    </ScrollView>
  );
};
